# Week 2 Lab

**Datasets**:

The following datasets are used in this lab.

- [nyc_subway_stations.tsv](https://storage.googleapis.com/qm2/CASA0025/nyc_subway_stations.tsv)
- [nyc_neighborhoods.tsv](https://storage.googleapis.com/qm2/CASA0025/nyc_neighborhoods.tsv)

In [ ]:
%pip install duckdb duckdb-engine jupysql

In [1]:
import duckdb

%load_ext sql

In [6]:
%config SqlMagic.autopandas = True
%config SqlMagic.feedback = False
%config SqlMagic.displaycon = False

In [2]:
%sql duckdb:///:memory:

Connecting to 'duckdb:///:memory:'

## Question 1: Creating Tables

Create a database, then write a SQL query to create a table named `nyc_subway_stations` and load the data from the file `nyc_subway_stations.tsv` into it. Similarly, create a table named `nyc_neighborhoods` and load the data from the file `nyc_neighborhoods.tsv` into it.

In [28]:
%%sql
INSTALL httpfs;
LOAD httpfs;

CREATE OR REPLACE TABLE nyc_subway_stations AS
SELECT *
FROM read_csv_auto(
  'https://storage.googleapis.com/qm2/CASA0025/nyc_subway_stations.tsv',
  delim='\t',
  header=True
);

CREATE OR REPLACE TABLE nyc_neighborhoods AS
SELECT *
FROM read_csv_auto(
  'https://storage.googleapis.com/qm2/CASA0025/nyc_neighborhoods.tsv',
  delim='\t',
  header=True
);

Running query in 'duckdb:///:memory:'

+-------+
| Count |
+-------+
+-------+

In [33]:
%%sql
SUMMARIZE nyc_subway_stations;

Running query in 'duckdb:///:memory:'

+-------------+-------------+------------------------+----------------------+---------------+--------------------+-------------------+--------+-------+-------------------+-------+-----------------+
| column_name | column_type |          min           |         max          | approx_unique |        avg         |        std        |  q25   |  q50  |        q75        | count | null_percentage |
+-------------+-------------+------------------------+----------------------+---------------+--------------------+-------------------+--------+-------+-------------------+-------+-----------------+
|   OBJECTID  |    BIGINT   |           1            |         491          |      509      |       246.0        | 141.8837552364611 |  123   |  246  |        369        |  491  |       0.00      |
|      ID     |    DOUBLE   |          1.0           |        909.0         |      496      | 260.16700610997964 | 168.7609485820829 | 125.25 | 252.0 | 377.7916666666667 |  491  |       0.00      |
|     NAME    |   VARCHAR   |        103rd St        |      Zerega Ave      |      379      |        None        |        None       |  None  |  None |        None       |  491  |       0.00      |
|   ALT_NAME  |   VARCHAR   |        110th St        |    Yankee Stadium    |      137      |        None        |        None       |  None  |  None |        None       |  491  |      72.10      |
|   CROSS_ST  |   VARCHAR   |        10th Ave        |     Wyckoff Ave      |      153      |        None        |        None       |  None  |  None |        None       |  491  |       7.54      |
|  LONG_NAME  |   VARCHAR   | 103rd St (1) Manhattan | Zerega Ave (6) Bronx |      430      |        None        |        None       |  None  |  None |        None       |  491  |       0.00      |
|    LABEL    |   VARCHAR   |      103rd St (1)      |    Zerega Ave (6)    |      451      |        None        |        None       |  None  |  None |        None       |  491  |       0.00      |
|   BOROUGH   |   VARCHAR   |         Bronx          |    Staten Island     |       4       |        None        |        None       |  None  |  None |        None       |  491  |       0.00      |
|    NGHBHD   |   VARCHAR   |          None          |         None         |       0       |        None        |        None       |  None  |  None |        None       |  491  |      100.00     |
|    ROUTES   |   VARCHAR   |           1            |          S           |       79      |        None        |        None       |  None  |  None |        None       |  491  |       6.52      |
+-------------+-------------+------------------------+----------------------+---------------+--------------------+-------------------+--------+-------+-------------------+-------+-----------------+
Truncated to displaylimit of 10.

In [34]:
%%sql
SUMMARIZE nyc_neighborhoods;

Running query in 'duckdb:///:memory:'

+-------------+-------------+-----------+-----------+---------------+------+------+------+------+------+-------+-----------------+
| column_name | column_type |    min    |    max    | approx_unique | avg  | std  | q25  | q50  | q75  | count | null_percentage |
+-------------+-------------+-----------+-----------+---------------+------+------+------+------+------+-------+-----------------+
|   BORONAME  |   VARCHAR   |  Brooklyn | The Bronx |       4       | None | None | None | None | None |  129  |       0.00      |
|     NAME    |   VARCHAR   | Annandale | Yorkville |      135      | None | None | None | None | None |  129  |       0.00      |
+-------------+-------------+-----------+-----------+---------------+------+------+------+------+------+-------+-----------------+

In [8]:
%%sql
SELECT COUNT(*) AS n_subway FROM nyc_subway_stations;

SELECT COUNT(*) AS n_neigh FROM nyc_neighborhoods;

Running query in 'duckdb:///:memory:'

+---------+
| n_neigh |
+---------+
|   129   |
+---------+

## Question 2: Column Filtering

Write a SQL query to display the `ID`, `NAME`, and `BOROUGH` of each subway station in the `nyc_subway_stations` dataset.

In [39]:
%%sql
SELECT
  ID,
  NAME,
  BOROUGH
FROM nyc_subway_stations;

Running query in 'duckdb:///:memory:'

+-------+--------------+-----------+
|   ID  |     NAME     |  BOROUGH  |
+-------+--------------+-----------+
| 376.0 | Cortlandt St | Manhattan |
|  2.0  |  Rector St   | Manhattan |
|  1.0  | South Ferry  | Manhattan |
| 125.0 |   138th St   |   Bronx   |
| 126.0 |   149th St   |   Bronx   |
|  45.0 |   149th St   |   Bronx   |
| 127.0 |   161st St   |   Bronx   |
| 208.0 |   167th St   |   Bronx   |
| 128.0 |   167th St   |   Bronx   |
| 209.0 |   170th St   |   Bronx   |
+-------+--------------+-----------+
Truncated to displaylimit of 10.

## Question 3: Row Filtering

Write a SQL query to find all subway stations in the `nyc_subway_stations` dataset that are located in the borough of Manhattan.

In [40]:
%%sql
SELECT *
FROM nyc_subway_stations
WHERE BOROUGH = 'Manhattan';

Running query in 'duckdb:///:memory:'

+----------+-------+--------------+--------------------+-------------------+-----------------------------------------------+-------------------------------------+-----------+--------+---------+---------------+-------------+---------+--------+
| OBJECTID |   ID  |     NAME     |      ALT_NAME      |      CROSS_ST     |                   LONG_NAME                   |                LABEL                |  BOROUGH  | NGHBHD |  ROUTES |   TRANSFERS   |    COLOR    | EXPRESS | CLOSED |
+----------+-------+--------------+--------------------+-------------------+-----------------------------------------------+-------------------------------------+-----------+--------+---------+---------------+-------------+---------+--------+
|    1     | 376.0 | Cortlandt St |        None        |     Church St     |          Cortlandt St (R,W) Manhattan         |          Cortlandt St (R,W)         | Manhattan |  None  |   R,W   |      R,W      |    YELLOW   |   None  |  None  |
|    2     |  2.0  |  Rector St   |        None        |        None       |            Rector St (1) Manhattan            |            Rector St (1)            | Manhattan |  None  |    1    |       1       |     RED     |   None  |  None  |
|    3     |  1.0  | South Ferry  |        None        |        None       |           South Ferry (1) Manhattan           |           South Ferry (1)           | Manhattan |  None  |    1    |       1       |     RED     |   None  |  None  |
|    25    | 296.0 |   W 4th St   |        None        |      6th Ave      |          W 4th St (B,D,F,V) Manhattan         |          W 4th St (B,D,F,V)         | Manhattan |  None  | B,D,F,V | A,B,C,D,E,F,V |    ORANGE   | express |  None  |
|   242    | 121.0 |   103rd St   |        None        |   Lexington Ave   |             103rd St (6) Manhattan            |             103rd St (6)            | Manhattan |  None  |    6    |       6       |    GREEN    |   None  |  None  |
|   243    | 192.0 |   103rd St   |        None        | Central Park West |           103rd St (A,B,C) Manhattan          |           103rd St (A,B,C)          | Manhattan |  None  |  A,B,C  |     A,B,C     | BLUE-ORANGE |   None  |  None  |
|   244    |  22.0 |   103rd St   |        None        |      Broadway     |             103rd St (1) Manhattan            |             103rd St (1)            | Manhattan |  None  |    1    |       1       |     RED     |   None  |  None  |
|   245    | 122.0 |   110th St   |        None        |   Lexington Ave   |             110th St (6) Manhattan            |             110th St (6)            | Manhattan |  None  |    6    |       6       |    GREEN    |   None  |  None  |
|   246    | 193.0 |   110th St   |   Cathedral Pky    | Central Park West |    110th St / Cathedral Pky (B,C) Manhattan   |    110th St / Cathedral Pky (B,C)   | Manhattan |  None  |   B,C   |      B,C      | BLUE-ORANGE |   None  |  None  |
|   247    |  39.0 |   110th St   | Central Park North |     Lenox Ave     | 110th St / Central Park North (2,3) Manhattan | 110th St / Central Park North (2,3) | Manhattan |  None  |   2,3   |      2,3      |     RED     | express |  None  |
+----------+-------+--------------+--------------------+-------------------+-----------------------------------------------+-------------------------------------+-----------+--------+---------+---------------+-------------+---------+--------+
Truncated to displaylimit of 10.

## Question 4: Sorting Results

Write a SQL query to list the subway stations in the `nyc_subway_stations` dataset in alphabetical order by their names.

In [41]:
%%sql
SELECT *
FROM nyc_subway_stations
ORDER BY NAME;

Running query in 'duckdb:///:memory:'

+----------+-------+----------+--------------------+-------------------+-----------------------------------------------+-------------------------------------+-----------+--------+--------+-----------+-------------+---------+--------+
| OBJECTID |   ID  |   NAME   |      ALT_NAME      |      CROSS_ST     |                   LONG_NAME                   |                LABEL                |  BOROUGH  | NGHBHD | ROUTES | TRANSFERS |    COLOR    | EXPRESS | CLOSED |
+----------+-------+----------+--------------------+-------------------+-----------------------------------------------+-------------------------------------+-----------+--------+--------+-----------+-------------+---------+--------+
|   244    |  22.0 | 103rd St |        None        |      Broadway     |             103rd St (1) Manhattan            |             103rd St (1)            | Manhattan |  None  |   1    |     1     |     RED     |   None  |  None  |
|   243    | 192.0 | 103rd St |        None        | Central Park West |           103rd St (A,B,C) Manhattan          |           103rd St (A,B,C)          | Manhattan |  None  | A,B,C  |   A,B,C   | BLUE-ORANGE |   None  |  None  |
|   242    | 121.0 | 103rd St |        None        |   Lexington Ave   |             103rd St (6) Manhattan            |             103rd St (6)            | Manhattan |  None  |   6    |     6     |    GREEN    |   None  |  None  |
|   376    | 174.0 | 103rd St |    Corona Plaza    |   Roosevelt Ave   |       103rd St / Corona Plaza (7) Queens      |     103rd St / Corona Plaza (7)     |   Queens  |  None  |   7    |     7     |    PURPLE   |   None  |  None  |
|   377    | 239.0 | 104th St |        None        |    Liberty Ave    |              104th St (A) Queens              |             104th St (A)            |   Queens  |  None  |   A    |     A     |     BLUE    |   None  |  None  |
|   378    | 329.0 | 104th St |        None        |    Jamaica Ave    |             104th St (J,Z) Queens             |            104th St (J,Z)           |   Queens  |  None  |  J,Z   |    J,Z    |    BROWN    |   None  |  None  |
|   245    | 122.0 | 110th St |        None        |   Lexington Ave   |             110th St (6) Manhattan            |             110th St (6)            | Manhattan |  None  |   6    |     6     |    GREEN    |   None  |  None  |
|   247    |  39.0 | 110th St | Central Park North |     Lenox Ave     | 110th St / Central Park North (2,3) Manhattan | 110th St / Central Park North (2,3) | Manhattan |  None  |  2,3   |    2,3    |     RED     | express |  None  |
|   246    | 193.0 | 110th St |   Cathedral Pky    | Central Park West |    110th St / Cathedral Pky (B,C) Manhattan   |    110th St / Cathedral Pky (B,C)   | Manhattan |  None  |  B,C   |    B,C    | BLUE-ORANGE |   None  |  None  |
|   379    | 240.0 | 111th St |        None        |    Liberty Ave    |              111th St (A) Queens              |             111th St (A)            |   Queens  |  None  |   A    |     A     |     BLUE    |   None  |  None  |
+----------+-------+----------+--------------------+-------------------+-----------------------------------------------+-------------------------------------+-----------+--------+--------+-----------+-------------+---------+--------+
Truncated to displaylimit of 10.

## Question 5: Unique Values

Write a SQL query to find the distinct boroughs represented in the `nyc_subway_stations` dataset.

In [42]:
%%sql
SELECT DISTINCT BOROUGH
FROM nyc_subway_stations;

Running query in 'duckdb:///:memory:'

+---------------+
|    BOROUGH    |
+---------------+
|    Brooklyn   |
|     Queens    |
|   Manhattan   |
|     Bronx     |
| Staten Island |
+---------------+

## Question 6: Counting Rows

Write a SQL query to count the number of subway stations in each borough in the `nyc_subway_stations` dataset.

In [43]:
%%sql
SELECT
  BOROUGH,
  COUNT(*) AS station_count
FROM nyc_subway_stations
GROUP BY BOROUGH;

Running query in 'duckdb:///:memory:'

+---------------+---------------+
|    BOROUGH    | station_count |
+---------------+---------------+
|    Brooklyn   |      170      |
|     Queens    |       90      |
|   Manhattan   |      140      |
|     Bronx     |       69      |
| Staten Island |       22      |
+---------------+---------------+

## Question 7: Aggregating Data

Write a SQL query to list the number of subway stations in each borough, sorted in descending order by the count.

In [44]:
%%sql
SELECT
  BOROUGH,
  COUNT(*) AS station_count
FROM nyc_subway_stations
GROUP BY BOROUGH
ORDER BY station_count DESC;

Running query in 'duckdb:///:memory:'

+---------------+---------------+
|    BOROUGH    | station_count |
+---------------+---------------+
|    Brooklyn   |      170      |
|   Manhattan   |      140      |
|     Queens    |       90      |
|     Bronx     |       69      |
| Staten Island |       22      |
+---------------+---------------+

## Question 8: Joining Tables

Write a SQL query to join the `nyc_subway_stations` and `nyc_neighborhoods` datasets on the borough name, displaying the subway station name and the neighborhood name.

In [45]:
%%sql
SELECT
  s.NAME AS station_name,
  n.NAME AS neighborhood_name
FROM nyc_subway_stations AS s
JOIN nyc_neighborhoods AS n
  ON s.BOROUGH = n.BORONAME;

Running query in 'duckdb:///:memory:'

+--------------+-------------------+
| station_name | neighborhood_name |
+--------------+-------------------+
| Cortlandt St |     Chinatown     |
|  Rector St   |     Chinatown     |
| South Ferry  |     Chinatown     |
|   W 4th St   |     Chinatown     |
|   15th St    |      Red Hook     |
|   18th Ave   |      Red Hook     |
|   18th Ave   |      Red Hook     |
|   18th Ave   |      Red Hook     |
|   20th Ave   |      Red Hook     |
|   20th Ave   |      Red Hook     |
+--------------+-------------------+
Truncated to displaylimit of 10.

## Question 9: String Manipulation

Write a SQL query to display the names of subway stations in the `nyc_subway_stations` dataset that contain the word "St" in their names.

In [46]:
%%sql
SELECT
  ID,
  NAME,
  BOROUGH
FROM nyc_subway_stations
WHERE NAME LIKE '%St%';

Running query in 'duckdb:///:memory:'

+-------+--------------+-----------+
|   ID  |     NAME     |  BOROUGH  |
+-------+--------------+-----------+
| 376.0 | Cortlandt St | Manhattan |
|  2.0  |  Rector St   | Manhattan |
| 125.0 |   138th St   |   Bronx   |
| 126.0 |   149th St   |   Bronx   |
|  45.0 |   149th St   |   Bronx   |
| 127.0 |   161st St   |   Bronx   |
| 208.0 |   167th St   |   Bronx   |
| 128.0 |   167th St   |   Bronx   |
| 209.0 |   170th St   |   Bronx   |
| 129.0 |   170th St   |   Bronx   |
+-------+--------------+-----------+
Truncated to displaylimit of 10.

## Question 10: Filtering with Multiple Conditions

Write a SQL query to find all subway stations in the `nyc_subway_stations` dataset that are in the borough of Brooklyn and have routes that include the letter "R".

In [47]:
%%sql
SELECT
  ID,
  NAME,
  BOROUGH,
  ROUTES
FROM nyc_subway_stations
WHERE BOROUGH = 'Brooklyn'
  AND ROUTES LIKE '%R%';

Running query in 'duckdb:///:memory:'

+-------+---------------+----------+---------+
|   ID  |      NAME     | BOROUGH  |  ROUTES |
+-------+---------------+----------+---------+
| 406.0 |    25th St    | Brooklyn |   M,R   |
| 407.0 |    36th St    | Brooklyn | D,M,N,R |
| 408.0 |    45th St    | Brooklyn |    R    |
| 409.0 |    53rd St    | Brooklyn |    R    |
| 410.0 |    59th St    | Brooklyn |   N,R   |
| 412.0 |    77th St    | Brooklyn |    R    |
| 413.0 |    86th St    | Brooklyn |    R    |
| 414.0 |    95th St    | Brooklyn |    R    |
| 404.0 |     9th St    | Brooklyn |   M,R   |
| 411.0 | Bay Ridge Ave | Brooklyn |    R    |
+-------+---------------+----------+---------+
Truncated to displaylimit of 10.

Once you've completed your attempt, you can check your answers [here](https://github.com/oballinger/CASA0025/blob/main/notebooks/W02_lab_solution.ipynb).